package taeho_study.javajungsuk_chapter6;

public class Prac6_11 {

  public static void main(String[] args) {
    // TODO Auto-generated method stub

    this에 대한 설명으로 맞지 않은 것은? (모두 고르시오)

        a. 객체 자신을 가리키는 참조변수이다.
        // 클래스 내에 인스턴스 직접 가르키는건 맞지. 이거 맞는 이야기인듯

        b. 클래스 내에서라면 어디서든 사용할 수 있다.
        // 음.. 클래스 내부에서는 같은 인스턴스 공유하니 맞는 듯

        c. 지역변수와 인스턴스변수를 구별할 때 사용한다.
        // 인스턴스 변수만 포함되니 구별은 할 수 있는데 용도가 그건가..? 일단 맞다고 하자

        d. 클래스 메서드 내에서는 사용할 수 없다.
        // 얘도 맞는거 같은데..? 클래스 메서드에서는 인스턴스 아예 못쓰는데..?

        // 굳이 답 하나 고르자면.. b..? d보기 읽고나니 인스턴스 클래스 내부에서는 못씀.



  }

}
