package taeho_study.javajungsuk_chapter6;

public class Prac6_12 {

  public static void main(String[] args) {
    // TODO Auto-generated method stub

    // 오버로딩을 지금 지식으로 정리하면. 메서드 이름을 같게 하여
    // 사용자가 좀 더 쉽게 이 메서드를 사용하게 하기 위한 것인데
    // 매개변수의 개수나 타입이 달라서 무슨 메서드를 써도 동일한 기능으로 만드는 그런것..?

    다음 중 오버로딩이 성립하기 위한 조건이 아닌 것은? (죄다 모르 고르래..)

        a. 메서드의 이름이 같아야 한다.
        // 당연하지. 오버로딩의 가장 큰 이유지

        b. 매개변수의 개수나 타입이 달라야 한다.
        // 당연하지. 같으면 어떤 메서드를 호출할 지 컴파일러가 알 수 없음

        c. 리턴타입이 달라야 한다.
        // 굳이 상관없음

        d. 매개변수의 이름이 달라야 한다.
        // 이름도 굳이 상관 없음

        답은.. c랑 d?
            good

  }

}
