package taeho_study.javajungsuk_chapter6;

public class Prac6_10 {

  public static void main(String[] args) {
    // TODO Auto-generated method stub

    생성자에 대한 설명으로 옳지 않은 것은?(모두 고르시오)

        a. 모든 생성자의 이름은 클래스의 이름과 동일해야 한다.
        // 넘나 당연한 것

        b. 생성자는 객체를 생성하기 위한 것이다.
        // 인스턴스 초기화가 목적이긴 한데 객체를 생성하기 위한 것도 맞지?

        //*** 내가 적은게 맞았음.. 생성자의 원래 목적은 인스턴스 초기화이고
        // 객체 생성은 new 연산자가 함.. 얘도 틀림

        c. 클래스에서는 생성자가 반드시 하나 이상 있어야 한다.
        // 아주 옳은 소리. 없으면 기본으로 클래스명() 하나 jvm이 친절하게 만들어 줌

        d. 생성자가 없는 클래스는 컴파일러가 기본 생성자를 추가한다.
        // c에서 적은 내용이 바로 이것!

        e. 생성자는 오버로딩 할 수 없다.
        // 오버로딩이 같은 이름으로 여러가지 만드는건데 생성자도 가능한데..?
        // 틀린거 고르는거니 e가 답인듯



  }

}
